import copy

levels_data = {
    1: {
        'horizontal_sticks': [
            [0, 0, 0, 0],
            [0, 1, 1, 0],
            [1, 1, 1, 1],
            [1, 1, 1, 1],
            [0, 0, 0, 0],
            [0, 0, 0, 0],
        ],
        'vertical_sticks': [
            [0, 0, 0, 0, 0],
            [0, 1, 1, 1, 0],
            [1, 1, 1, 1, 1],
            [0, 0, 0, 0, 0],
            [0, 0, 0, 0, 0],
        ],
        'task': 'Уберите 3 спички так, чтобы получить 4 квадрата',
        'answer': {
            'horizontal_sticks': [
                [0, 0, 0, 0],
                [0, 1, 1, 0],
                [1, 1, 1, 1],
                [1, 0, 0, 1],
                [0, 0, 0, 0],
                [0, 0, 0, 0],
            ],
            'vertical_sticks': [
                [0, 0, 0, 0, 0],
                [0, 1, 1, 1, 0],
                [1, 1, 0, 1, 1],
                [0, 0, 0, 0, 0],
                [0, 0, 0, 0, 0],
            ]
        },
        'type': 'remove',
        'moves': 3,
        'squares': 4,
        'equal': False
    },

    2: {
        'horizontal_sticks': [
            [0, 0, 0, 0],
            [1, 0, 1, 0],
            [1, 1, 1, 0],
            [1, 1, 1, 0],
            [0, 0, 0, 0],
            [0, 0, 0, 0],
        ],
        'vertical_sticks': [
            [0, 0, 0, 0, 0],
            [1, 1, 1, 1, 0],
            [1, 1, 1, 1, 0],
            [0, 0, 0, 0, 0],
            [0, 0, 0, 0, 0],
        ],
        'task': 'Передвиньте 3 спички так, чтобы получить 4 \nравных квадрата',
        'answer': {
            'horizontal_sticks': [
                [0, 0, 0, 0],
                [1, 0, 1, 0],
                [1, 1, 1, 1],
                [0, 1, 0, 1],
                [0, 0, 0, 0],
                [0, 0, 0, 0],
            ],
            'vertical_sticks': [
                [0, 0, 0, 0, 0],
                [1, 1, 1, 1, 0],
                [0, 1, 1, 1, 1],
                [0, 0, 0, 0, 0],
                [0, 0, 0, 0, 0],
            ]
        },
        'type': 'move',
        'moves': 3,
        'squares': 4,
        'equal': True
    },

    3: {
        'horizontal_sticks': [
            [0, 0, 0, 0],
            [0, 1, 1, 1],
            [1, 1, 1, 1],
            [1, 1, 0, 0],
            [0, 0, 0, 0],
            [0, 0, 0, 0],
        ],
        'vertical_sticks': [
            [0, 0, 0, 0, 0],
            [0, 1, 1, 1, 1],
            [1, 1, 1, 0, 0],
            [0, 0, 0, 0, 0],
            [0, 0, 0, 0, 0],
        ],
        'task': 'Передвиньте 2 спички так, чтобы \nполучить 4 квадрата',
        'answer': {
            'horizontal_sticks': [
                [0, 0, 0, 0],
                [0, 1, 1, 1],
                [1, 0, 1, 1],
                [1, 1, 1, 0],
                [0, 0, 0, 0],
                [0, 0, 0, 0],
            ],
            'vertical_sticks': [
                [0, 0, 0, 0, 0],
                [0, 1, 0, 1, 1],
                [1, 1, 1, 1, 0],
                [0, 0, 0, 0, 0],
                [0, 0, 0, 0, 0],
            ]
        },
        'type': 'move',
        'moves': 2,
        'squares': 4,
        'equal': False
    },

    4: {
        'horizontal_sticks': [
            [0, 0, 0, 0],
            [1, 1, 1, 1],
            [1, 1, 1, 1],
            [1, 1, 1, 1],
            [0, 0, 0, 0],
            [0, 0, 0, 0],
        ],
        'vertical_sticks': [
            [0, 1, 1, 1, 0],
            [0, 1, 1, 1, 0],
            [0, 1, 1, 1, 0],
            [0, 1, 1, 1, 0],
            [0, 0, 0, 0, 0],
        ],
        'task': 'Передвиньте 8 спичек так, чтобы \nполучить 5 квадратов',
        'answer': {
            'horizontal_sticks': [
                [1, 0, 0, 1],
                [1, 1, 1, 1],
                [0, 0, 0, 0],
                [1, 1, 1, 1],
                [1, 0, 0, 1],
                [0, 0, 0, 0],
            ],
            'vertical_sticks': [
                [1, 1, 0, 1, 1],
                [0, 1, 0, 1, 0],
                [0, 1, 0, 1, 0],
                [1, 1, 0, 1, 1],
                [0, 0, 0, 0, 0],
            ]
        },
        'type': 'move',
        'moves': 8,
        'squares': 5,
        'equal': False
    },

    5: {
        'horizontal_sticks': [
            [0, 0, 0, 0],
            [0, 0, 0, 1],
            [0, 1, 1, 1],
            [0, 1, 1, 1],
            [0, 1, 1, 1],
            [0, 0, 0, 0],
        ],
        'vertical_sticks': [
            [0, 0, 0, 0, 0],
            [0, 0, 0, 1, 1],
            [0, 1, 1, 1, 1],
            [0, 1, 1, 1, 1],
            [0, 0, 0, 0, 0],
        ],
        'task': 'Передвиньте 7 спичек так, чтобы \nполучить 4 квадрата',
        'answer': {
            'horizontal_sticks': [
                [0, 0, 0, 0],
                [1, 0, 0, 1],
                [1, 1, 1, 1],
                [0, 0, 0, 0],
                [1, 1, 1, 1],
                [0, 0, 0, 0],
            ],
            'vertical_sticks': [
                [0, 0, 0, 0, 0],
                [1, 1, 0, 1, 1],
                [1, 0, 1, 0, 1],
                [1, 0, 1, 0, 1],
                [0, 0, 0, 0, 0],
            ]
        },
        'type': 'move',
        'moves': 7,
        'squares': 4,
        'equal': False
    },

    6: {
        'horizontal_sticks': [
            [0, 0, 1, 1],
            [0, 1, 1, 1],
            [0, 1, 1, 1],
            [0, 1, 1, 1],
            [0, 0, 0, 0],
            [0, 0, 0, 0],
        ],
        'vertical_sticks': [
            [0, 0, 1, 1, 1],
            [0, 1, 1, 1, 1],
            [0, 1, 1, 1, 1],
            [0, 0, 0, 0, 0],
            [0, 0, 0, 0, 0],
        ],
        'task': 'Передвиньте 2 спички так, чтобы \nполучить 7 равных квадратов ',
        'answer': {
            'horizontal_sticks': [
                [0, 1, 1, 1],
                [0, 1, 1, 1],
                [0, 1, 1, 1],
                [0, 1, 0, 1],
                [0, 0, 0, 0],
                [0, 0, 0, 0],
            ],
            'vertical_sticks': [
                [0, 1, 1, 1, 1],
                [0, 1, 1, 1, 0],
                [0, 1, 1, 1, 1],
                [0, 0, 0, 0, 0],
                [0, 0, 0, 0, 0],
            ]
        },
        'type': 'move',
        'moves': 2,
        'squares': 7,
        'equal': True
    },

    7: {
        'horizontal_sticks': [
            [0, 0, 0, 0],
            [0, 1, 1, 1],
            [0, 1, 1, 1],
            [0, 1, 1, 1],
            [0, 1, 1, 1],
            [0, 0, 0, 0],
        ],
        'vertical_sticks': [
            [0, 0, 0, 0, 0],
            [0, 1, 1, 1, 1],
            [0, 1, 1, 1, 1],
            [0, 1, 1, 1, 1],
            [0, 0, 0, 0, 0],
        ],
        'task': 'Уберите 8 спичек так, чтобы \nполучить 4 равных квадрата ',
        'answer': {
            'horizontal_sticks': [
                [0, 0, 0, 0],
                [0, 1, 0, 1],
                [0, 1, 0, 1],
                [0, 1, 0, 1],
                [0, 1, 0, 1],
                [0, 0, 0, 0],
            ],
            'vertical_sticks': [
                [0, 0, 0, 0, 0],
                [0, 1, 1, 1, 1],
                [0, 0, 0, 0, 0],
                [0, 1, 1, 1, 1],
                [0, 0, 0, 0, 0],
            ]
        },
        'type': 'remove',
        'moves': 8,
        'squares': 4,
        'equal': True
    },

    8: {
        'horizontal_sticks': [
            [0, 0, 0, 0],
            [0, 1, 0, 0],
            [1, 1, 1, 0],
            [1, 1, 1, 0],
            [0, 1, 0, 0],
            [0, 0, 0, 0],
        ],
        'vertical_sticks': [
            [0, 0, 0, 0, 0],
            [0, 1, 1, 0, 0],
            [1, 1, 1, 1, 0],
            [0, 1, 1, 0, 0],
            [0, 0, 0, 0, 0],
        ],
        'task': 'Передвиньте 8 спичек так, чтобы \nполучить 3 квадрата ',
        'answer': {
            'horizontal_sticks': [
                [0, 0, 0, 1],
                [0, 1, 1, 1],
                [0, 0, 0, 0],
                [1, 1, 1, 0],
                [1, 0, 0, 0],
                [0, 0, 0, 0],
            ],
            'vertical_sticks': [
                [0, 0, 0, 1, 1],
                [0, 1, 0, 1, 0],
                [0, 1, 0, 1, 0],
                [1, 1, 0, 0, 0],
                [0, 0, 0, 0, 0],
            ]
        },
        'type': 'move',
        'moves': 8,
        'squares': 3,
        'equal': False
    },

    9: {
        'horizontal_sticks': [
            [0, 1, 1, 1],
            [0, 1, 1, 1],
            [0, 1, 1, 1],
            [0, 1, 1, 1],
            [0, 0, 0, 0],
            [0, 0, 0, 0],
        ],
        'vertical_sticks': [
            [0, 1, 1, 1, 1],
            [0, 1, 1, 1, 1],
            [0, 1, 1, 1, 1],
            [0, 0, 0, 0, 0],
            [0, 0, 0, 0, 0],
        ],
        'task': 'Уберите 4 спички так, чтобы \nполучить 5 квадратов ',
        'answer': {
            'horizontal_sticks': [
                [0, 1, 1, 1],
                [0, 1, 0, 1],
                [0, 1, 0, 1],
                [0, 1, 1, 1],
                [0, 0, 0, 0],
                [0, 0, 0, 0],
            ],
            'vertical_sticks': [
                [0, 1, 1, 1, 1],
                [0, 1, 0, 0, 1],
                [0, 1, 1, 1, 1],
                [0, 0, 0, 0, 0],
                [0, 0, 0, 0, 0],
            ]
        },
        'type': 'remove',
        'moves': 4,
        'squares': 5,
        'equal': False
    },

    10: {
        'horizontal_sticks': [
            [0, 0, 0, 0],
            [0, 1, 1, 1],
            [1, 1, 1, 1],
            [1, 1, 1, 0],
            [0, 0, 0, 0],
            [0, 0, 0, 0],
        ],
        'vertical_sticks': [
            [0, 0, 0, 0, 0],
            [0, 1, 1, 1, 1],
            [1, 1, 1, 1, 0],
            [0, 0, 0, 0, 0],
            [0, 0, 0, 0, 0],
        ],
        'task': 'Уберите 2 спички так, чтобы \nполучить 4 равных квадрата ',
        'answer': {
            'horizontal_sticks': [
                [0, 0, 0, 0],
                [0, 1, 0, 1],
                [1, 1, 1, 1],
                [1, 0, 1, 0],
                [0, 0, 0, 0],
                [0, 0, 0, 0],
            ],
            'vertical_sticks': [
                [0, 0, 0, 0, 0],
                [0, 1, 1, 1, 1],
                [1, 1, 1, 1, 0],
                [0, 0, 0, 0, 0],
                [0, 0, 0, 0, 0],
            ]
        },
        'type': 'remove',
        'moves': 2,
        'squares': 4,
        'equal': True
    },

    11: {
        'horizontal_sticks': [
            [0, 0, 0, 0],
            [0, 1, 1, 0],
            [0, 1, 1, 0],
            [0, 1, 1, 0],
            [0, 0, 0, 0],
            [0, 0, 0, 0],
        ],
        'vertical_sticks': [
            [0, 0, 1, 0, 0],
            [0, 0, 1, 0, 0],
            [0, 0, 1, 0, 0],
            [0, 0, 1, 0, 0],
            [0, 0, 0, 0, 0],
        ],
        'task': 'Передвиньте 4 спички так, чтобы \nполучить 2 квадрата ',
        'answer': {
            'horizontal_sticks': [
                [0, 0, 0, 0],
                [0, 1, 1, 0],
                [0, 0, 1, 0],
                [0, 1, 1, 0],
                [0, 0, 0, 0],
                [0, 0, 0, 0],
            ],
            'vertical_sticks': [
                [0, 0, 0, 0, 0],
                [0, 1, 0, 1, 0],
                [0, 1, 1, 1, 0],
                [0, 0, 0, 0, 0],
                [0, 0, 0, 0, 0],
            ]
        },
        'type': 'move',
        'moves': 4,
        'squares': 2,
        'equal': False
    },

    12: {
        'horizontal_sticks': [
            [0, 0, 0, 0],
            [0, 0, 0, 0],
            [0, 0, 1, 0],
            [0, 1, 1, 1],
            [0, 1, 0, 1],
            [0, 0, 0, 0],
        ],
        'vertical_sticks': [
            [0, 0, 0, 0, 0],
            [0, 0, 0, 0, 0],
            [0, 0, 1, 1, 0],
            [0, 1, 1, 1, 1],
            [0, 0, 0, 0, 0],
        ],
        'task': 'Передвиньте 5 спичек так, чтобы \nполучить 2 квадрата ',
        'answer': {
            'horizontal_sticks': [
                [0, 0, 0, 0],
                [0, 1, 1, 0],
                [0, 0, 0, 0],
                [0, 1, 1, 1],
                [0, 0, 0, 1],
                [0, 0, 0, 0],
            ],
            'vertical_sticks': [
                [0, 0, 0, 0, 0],
                [0, 1, 0, 1, 0],
                [0, 1, 0, 1, 0],
                [0, 0, 0, 1, 1],
                [0, 0, 0, 0, 0],
            ]
        },
        'type': 'move',
        'moves': 5,
        'squares': 2,
        'equal': False
    },

    13: {
        'horizontal_sticks': [
            [0, 0, 0, 0],
            [1, 1, 1, 1],
            [1, 1, 1, 1],
            [1, 1, 1, 1],
            [1, 1, 1, 1],
            [0, 0, 0, 0],
        ],
        'vertical_sticks': [
            [0, 0, 0, 0, 0],
            [1, 1, 1, 1, 1],
            [1, 1, 1, 1, 1],
            [1, 1, 1, 1, 1],
            [0, 0, 0, 0, 0],
        ],
        'task': 'Уберите 10 спичек так, чтобы \nполучить 4 квадрата ',
        'answer': {
            'horizontal_sticks': [
                [0, 0, 0, 0],
                [1, 1, 0, 1],
                [0, 0, 1, 1],
                [1, 1, 0, 0],
                [1, 0, 1, 1],
                [0, 0, 0, 0],
            ],
            'vertical_sticks': [
                [0, 0, 0, 0, 0],
                [1, 0, 1, 1, 1],
                [1, 0, 1, 0, 1],
                [1, 1, 1, 0, 1],
                [0, 0, 0, 0, 0],
            ]
        },
        'type': 'remove',
        'moves': 10,
        'squares': 4,
        'equal': False
    },

    14: {
        'horizontal_sticks': [
            [0, 0, 1, 0],
            [0, 1, 1, 1],
            [0, 1, 1, 1],
            [0, 0, 1, 0],
            [0, 0, 1, 0],
            [0, 0, 0, 0],
        ],
        'vertical_sticks': [
            [0, 0, 1, 1, 0],
            [0, 1, 1, 1, 1],
            [0, 0, 1, 1, 0],
            [0, 0, 1, 1, 0],
            [0, 0, 0, 0, 0],
        ],
        'task': 'Передвиньте 9 спичек так, чтобы \nполучить 4 квадрата ',
        'answer': {
            'horizontal_sticks': [
                [1, 1, 1, 1],
                [0, 0, 0, 0],
                [1, 1, 1, 1],
                [0, 1, 1, 0],
                [0, 0, 0, 0],
                [0, 0, 0, 0],
            ],
            'vertical_sticks': [
                [1, 0, 1, 0, 1],
                [1, 0, 1, 0, 1],
                [0, 1, 1, 1, 0],
                [0, 0, 0, 0, 0],
                [0, 0, 0, 0, 0],
            ]
        },
        'type': 'move',
        'moves': 9,
        'squares': 4,
        'equal': False
    },

    15: {
        'horizontal_sticks': [
            [0, 0, 0, 0],
            [1, 1, 1, 1],
            [1, 1, 1, 1],
            [1, 1, 1, 1],
            [1, 1, 1, 1],
            [0, 0, 0, 0],
        ],
        'vertical_sticks': [
            [0, 0, 0, 0, 0],
            [0, 1, 1, 1, 0],
            [0, 1, 1, 1, 0],
            [0, 1, 1, 1, 0],
            [0, 0, 0, 0, 0],
        ],
        'task': 'Передвиньте 6 спичек так, чтобы \nполучить 6 квадратов ',
        'answer': {
            'horizontal_sticks': [
                [0, 0, 0, 0],
                [1, 1, 1, 1],
                [1, 0, 1, 1],
                [1, 0, 0, 1],
                [1, 1, 1, 1],
                [0, 0, 0, 0],
            ],
            'vertical_sticks': [
                [0, 0, 0, 0, 0],
                [1, 1, 0, 0, 1],
                [1, 1, 1, 0, 1],
                [1, 1, 1, 1, 1],
                [0, 0, 0, 0, 0],
            ]
        },
        'type': 'move',
        'moves': 6,
        'squares': 6,
        'equal': False
    },

    16: {
        'horizontal_sticks': [
            [0, 0, 0, 0],
            [1, 0, 1, 0],
            [1, 1, 1, 0],
            [1, 1, 1, 0],
            [1, 0, 1, 0],
            [0, 0, 0, 0],
        ],
        'vertical_sticks': [
            [0, 0, 0, 0, 0],
            [1, 1, 1, 1, 0],
            [0, 1, 1, 0, 0],
            [1, 1, 1, 1, 0],
            [0, 0, 0, 0, 0],
        ],
        'task': 'Передвиньте 3 спички так, чтобы \nполучить 7 равных квадратов ',
        'answer': {
            'horizontal_sticks': [
                [0, 0, 0, 0],
                [1, 1, 1, 0],
                [1, 1, 1, 0],
                [1, 1, 1, 0],
                [1, 0, 0, 0],
                [0, 0, 0, 0],
            ],
            'vertical_sticks': [
                [0, 0, 0, 0, 0],
                [1, 1, 1, 1, 0],
                [1, 1, 1, 1, 0],
                [1, 1, 0, 0, 0],
                [0, 0, 0, 0, 0],
            ]
        },
        'type': 'move',
        'moves': 3,
        'squares': 7,
        'equal': True
    },

    17: {
        'horizontal_sticks': [
            [0, 1, 0, 0],
            [0, 1, 0, 0],
            [0, 1, 0, 0],
            [0, 1, 0, 0],
            [0, 1, 0, 0],
            [0, 1, 0, 0],
        ],
        'vertical_sticks': [
            [0, 1, 1, 0, 0],
            [0, 1, 1, 0, 0],
            [0, 1, 1, 0, 0],
            [0, 1, 1, 0, 0],
            [0, 1, 1, 0, 0],
        ],
        'task': 'Передвиньте 6 спичек так, чтобы \nполучить 4 равных квадрата ',
        'answer': {
            'horizontal_sticks': [
                [0, 1, 0, 0],
                [0, 1, 1, 0],
                [0, 1, 1, 0],
                [0, 1, 1, 0],
                [0, 0, 1, 0],
                [0, 0, 0, 0],
            ],
            'vertical_sticks': [
                [0, 1, 1, 0, 0],
                [0, 0, 1, 1, 0],
                [0, 1, 1, 0, 0],
                [0, 0, 1, 1, 0],
                [0, 0, 0, 0, 0],
            ]
        },
        'type': 'move',
        'moves': 6,
        'squares': 4,
        'equal': True
    },

    18: {
        'horizontal_sticks': [
            [1, 1, 1, 1],
            [1, 1, 1, 1],
            [1, 1, 1, 1],
            [1, 1, 1, 1],
            [1, 1, 1, 1],
            [0, 0, 0, 0],
        ],
        'vertical_sticks': [
            [1, 1, 1, 1, 1],
            [1, 1, 1, 1, 1],
            [1, 1, 1, 1, 1],
            [1, 1, 1, 1, 1],
            [0, 0, 0, 0, 0],
        ],
        'task': 'Уберите 16 спичек так, чтобы \nполучить 3 квадрата ',
        'answer': {
            'horizontal_sticks': [
                [1, 1, 1, 0],
                [0, 1, 1, 1],
                [0, 0, 0, 0],
                [1, 1, 1, 0],
                [0, 1, 1, 1],
                [0, 0, 0, 0],
            ],
            'vertical_sticks': [
                [1, 0, 0, 1, 0],
                [1, 1, 0, 1, 1],
                [1, 1, 0, 1, 1],
                [0, 1, 0, 0, 1],
                [0, 0, 0, 0, 0],
            ]
        },
        'type': 'remove',
        'moves': 16,
        'squares': 3,
        'equal': False
    }
}


def getLevelData(level_n):
    level_data = copy.deepcopy(levels_data[level_n])
    return level_data

